mtosi_2.0/2.0ME1/DDPs/ManageResourceInventory/IIS/xml/7-3_sit_getInventoryIteratorRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hdr="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1" xmlns:invr="http://www.tmforum.org/mtop/mri/xsd/rir/v1" xmlns:gen="http://www.tmforum.org/mtop/fmw/xsd/gen/v1" xmlns:nam="http://www.tmforum.org/mtop/fmw/xsd/nam/v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.tmforum.org/mtop/mri/xsd/rir/v1 ../xsd/ResourceInventoryRetrievalMessages.xsd  
http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <hdr:header>
      <hdr:activityName>getInventory</hdr:activityName>
      <hdr:msgName>getInventoryIteratorRequest</hdr:msgName>
      <hdr:msgType>REQUEST</hdr:msgType>
      <hdr:senderURI>/MTOSI/InventoryOS</hdr:senderURI>
      <hdr:destinationURI>/MTOSI/EMS01</hdr:destinationURI>
      <hdr:communicationPattern>MultipleBatchResponse</hdr:communicationPattern>
      <hdr:communicationStyle>RPC</hdr:communicationStyle>
      <hdr:iteratorReferenceURI>http://host:port/ResourceInventoryRetrievalV1/iterator123</hdr:iteratorReferenceURI>
      <hdr:timestamp>2007-07-30T09:26:00</hdr:timestamp>
    </hdr:header>
  </soap:Header>
  <soap:Body>
    <invr:getInventoryIteratorRequest/>
  </soap:Body>
</soap:Envelope>
